In [7]:
import numpy as np
import pandas as pd


from pydataset import data
from scipy import stats
from env import get_connection
from sqlalchemy import text, create_engine

For each of the following questions, formulate a null and alternative hypothesis (be as specific as you can be), then give an example of what a true positive, true negative, type I and type II errors would look like. 

Note that some of the questions are intentionally phrased in a vague way. 

It is your job to reword these as more precise questions that could be tested.

1) Has the network latency gone up since we switched internet service providers?

Null hypothesis : There has been no changes to the network latency since we switched internet providers.

Alternate hypothesis : The network latency has gone up since we switched internet service providers.

True Positive : It is indeed true that the network latency has gone up since switching providers because the analysis detects a significant increase in network latency.

True Negative : It is true that the latency has not changed since switching providers because the analysis correctly finds no significant increase in network latency.

Type I Error : The analysis incorrectly concludes that there is significant increase in network latency, but in reality, the latency has not changed since switching providers.

Type II Error : The analysis fails to detect a significant increase in network latency, but in reality, the latenct has gone up since switching providers.

2) Is the website redesign any good?

Null hypothesis : The website redesign has not played a significant role in improving performance or user engagement.

Alternative hypothesis : The website redesign has led to improved performance and user engagement.

True Positive : The website redesign is indeed effective because the evaluation indicates a significant improvement in performance and user engagement.

True Negative : The website redesign has not been effective because the evaluation correctly concludes that there is no significant improvement in performance and user engagement.

Type I : The evaluation is incorrect because it suggests a significant improvement in performance and user engagement even though there is no actual improvement.

Type II : The evaluation fails to detect a significant improvement in performance or user engagement, but the website redesign is actually effective

3) Is our television ad driving more sales?

Null hypothesis : Our television ad has not played a crucial in driving up overall sales.

Alternative hypothesis : Our television ad has led to a significant rise in overall sales.

True Positive : Based on our analysis, it is evident that our television ad has played a crucial role in driving up overall sales.

True Negative : It is evident that our television ad has not not led to a signiificant rise in overall sales, based on our analysis.

Type I : The analysis does not support the proposition that our television ad has resulted in a significant increase in overall sales, given that there has been no observed improvement in the overall sales figures.

Type II : The analysis fails to detect a significant increase in sales, despite the television ad being actually effective in drving up sales.

# Comparison of Groups

1) Use the following contingency table to help answer the question of whether using a macbook and being a codeup student are independent of each other.

 	Codeup Student	Not Codeup Student
Uses a Macbook	        49	  20

Doesn't Use A Macbook	1	  30

In [2]:
data = {
    'Codeup Student': [49, 1],
    'Not code up student': [20, 30],
}

index = ['Uses a Macbook', 'Does not Use A Macbook']

In [3]:
cs = pd.DataFrame(data, index=index)
cs

                        Codeup Student  Not code up student
Uses a Macbook                      49                   20
Does not Use A Macbook               1                   30

In [4]:
chi, p, degf, exp = stats.chi2_contingency(cs)

In [5]:
a = 0.05

if p < a:
    print('we reject the null hypothesis. There appears to be a relationship')
else:
    print('we fail to reject the null hypothesis')

we reject the null hypothesis. There appears to be a relationship

2) Choose another 2 categorical variables from the mpg dataset.

State your null and alternative hypotheses.

State your alpha.

Perform a chi2 test of independence.

State your conclusion

In [8]:
mpg = data('mpg')
mpg.head()

  manufacturer model  displ  year  cyl       trans drv  cty  hwy fl    class
1         audi    a4    1.8  1999    4    auto(l5)   f   18   29  p  compact
2         audi    a4    1.8  1999    4  manual(m5)   f   21   29  p  compact
3         audi    a4    2.0  2008    4  manual(m6)   f   20   31  p  compact
4         audi    a4    2.0  2008    4    auto(av)   f   21   30  p  compact
5         audi    a4    2.8  1999    6    auto(l5)   f   16   26  p  compact

In [9]:
mpg['suv_vs_nonsuv'] = np.where(mpg['class'].str.startswith('s'), 'suv', 'not_suv')
mpg.head()

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class,suv_vs_nonsuv
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,not_suv
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,not_suv
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,not_suv
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,not_suv
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,not_suv

In [10]:
mpg['4wd_vs_f_or_rwd'] = np.where(mpg['drv'].str.startswith('4'), '4wd', 'f_or_rwd')
mpg.head()

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class,suv_vs_nonsuv,4wd_vs_f_or_rwd
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,not_suv,f_or_rwd
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,not_suv,f_or_rwd
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,not_suv,f_or_rwd
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,not_suv,f_or_rwd
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,not_suv,f_or_rwd

Null hypothesis : There is no association between suvs and 4wd

Alternative : There is an association between suvs and 4wd

In [11]:
c_drv = pd.crosstab(mpg.suv_vs_nonsuv, mpg['4wd_vs_f_or_rwd'])
c_drv

4wd_vs_f_or_rwd  4wd  f_or_rwd
suv_vs_nonsuv
not_suv           48        89
suv               55        42

In [12]:
chi, p, degf, exp = stats.chi2_contingency(c_drv)

In [13]:
a = 0.05

if p < a:
    print('we reject the null hypothesis. There appears to be a relationship')
else:
    print('we fail to reject the null hypothesis')

we reject the null hypothesis. There appears to be a relationship

3) Use the data from the employees database to answer these questions:

Is an employee's gender independent of whether an employee works in sales or marketing? (only look at current employees)

Is an employee's gender independent of whether or not they are or have been a manager?

In [14]:
def get_db_url(database):
    return get_connection(database)

In [15]:
url = get_db_url('employees')

In [16]:
engine =  create_engine(url)

In [17]:
query = '''
        SELECT *
        FROM employees
        LEFT JOIN dept_emp ON dept_emp.emp_no = employees.emp_no
        LEFT JOIN departments ON departments.dept_no = dept_emp.dept_no
        WHERE to_date > CURDATE() AND (dept_name = 'sales' OR dept_name = 'marketing')
        '''

In [18]:
text_query = text(query)

In [19]:
df = pd.read_sql(text(query), engine.connect())
df.head()

,emp_no,birth_date,first_name,last_name,gender,hire_date,emp_no,dept_no,from_date,to_date,dept_no,dept_name
0,10017,1958-07-06,Cristinel,Bouloucos,F,1993-08-03,10017,d001,1993-08-03,9999-01-01,d001,Marketing
1,10058,1954-10-01,Berhard,McFarlin,M,1987-04-13,10058,d001,1988-04-25,9999-01-01,d001,Marketing
2,10140,1957-03-11,Yucel,Auria,F,1991-03-14,10140,d001,1991-03-14,9999-01-01,d001,Marketing
3,10228,1953-04-21,Karoline,Cesareni,F,1991-08-26,10228,d001,1993-01-28,9999-01-01,d001,Marketing
4,10239,1955-03-31,Nikolaos,Llado,F,1995-05-08,10239,d001,1996-05-04,9999-01-01,d001,Marketing

In [20]:
gd = pd.crosstab(df.gender, df.dept_name)
gd

dept_name  Marketing  Sales
gender
F               5864  14999
M               8978  22702

In [21]:
chi, p, degf, exp = stats.chi2_contingency(gd)

In [22]:
a = 0.05

if p < a:
    print('we reject the null hypothesis. There appears to be a relationship')
else:
    print('we fail to reject the null hypothesis')

we fail to reject the null hypothesis

In [23]:
query = '''
        SELECT *
        FROM employees
        LEFT JOIN dept_manager ON dept_manager.emp_no = employees.emp_no
        '''

In [24]:
text_query = text(query)

In [25]:
dfm = pd.read_sql(text(query), engine.connect())
dfm.head()

,emp_no,birth_date,first_name,last_name,gender,hire_date,emp_no,dept_no,from_date,to_date
0,10001,1953-09-02,Georgi,Facello,M,1986-06-26,NaN,None,None,None
1,10002,1964-06-02,Bezalel,Simmel,F,1985-11-21,NaN,None,None,None
2,10003,1959-12-03,Parto,Bamford,M,1986-08-28,NaN,None,None,None
3,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,NaN,None,None,None
4,10005,1955-01-21,Kyoichi,Maliniak,M,1989-09-12,NaN,None,None,None

In [26]:
dfm['managers'] = np.where(dfm['dept_no'].str.startswith('d'), 'manager', 'not_manager')
dfm.head()

,emp_no,birth_date,first_name,last_name,gender,hire_date,emp_no,dept_no,from_date,to_date,managers
0,10001,1953-09-02,Georgi,Facello,M,1986-06-26,NaN,None,None,None,not_manager
1,10002,1964-06-02,Bezalel,Simmel,F,1985-11-21,NaN,None,None,None,not_manager
2,10003,1959-12-03,Parto,Bamford,M,1986-08-28,NaN,None,None,None,not_manager
3,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,NaN,None,None,None,not_manager
4,10005,1955-01-21,Kyoichi,Maliniak,M,1989-09-12,NaN,None,None,None,not_manager

In [27]:
dfm.managers.value_counts()

not_manager    300000
manager            24
Name: managers, dtype: int64

In [28]:
m = pd.crosstab(dfm.gender, dfm.managers)
m

managers  manager  not_manager
gender
F              13       120038
M              11       179962

In [29]:
chi, p, degf, exp = stats.chi2_contingency(m)

In [31]:
a = 0.05

if p < a:
    print('we reject the null hypothesis. There appears to be a relationship')
else:
    print('we fail to reject the null hypothesis')

we fail to reject the null hypothesis